Autodesk.Revit.DB.OpenForeignOption
Options for opening files saved by an application that was not developed or licensed by Autodesk.
Since:
2019.2

Autodesk.Revit.DB.OpenForeignOption.Prompt
If possible, show a prompt to the user if a foreign file is detected. The operation may proceed or cancel based on the response.

Autodesk.Revit.DB.OpenForeignOption.DoNotOpen
Do not show any prompt to the user if a foreign file is detected. Cancel this operation (do not open the file).

Autodesk.Revit.DB.OpenForeignOption.Open
Do not show any prompt to the user if a foreign file is detected. Proceed to open.